; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l31_p31_c31_g31_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 warehouse)
	(crate-at crate2 warehouse)
	(crate-at crate3 warehouse)
	(crate-at crate4 warehouse)
	(crate-at crate5 warehouse)
	(crate-at crate6 warehouse)
	(crate-at crate7 warehouse)
	(crate-at crate8 warehouse)
	(crate-at crate9 warehouse)
	(crate-at crate10 warehouse)
	(crate-at crate11 warehouse)
	(crate-at crate12 warehouse)
	(crate-at crate13 warehouse)
	(crate-at crate14 warehouse)
	(crate-at crate15 warehouse)
	(crate-at crate16 warehouse)
	(crate-at crate17 warehouse)
	(crate-at crate18 warehouse)
	(crate-at crate19 warehouse)
	(crate-at crate20 warehouse)
	(crate-at crate21 warehouse)
	(crate-at crate22 warehouse)
	(crate-at crate23 warehouse)
	(crate-at crate24 warehouse)
	(crate-at crate25 warehouse)
	(crate-at crate26 warehouse)
	(crate-at crate27 warehouse)
	(crate-at crate28 warehouse)
	(crate-at crate29 warehouse)
	(crate-at crate30 warehouse)
	(crate-at crate31 warehouse)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate food crate16)
	(content-crate food crate17)
	(content-crate food crate18)
	(content-crate food crate19)
	(content-crate food crate20)
	(content-crate food crate21)
	(content-crate food crate22)
	(content-crate food crate23)
	(content-crate food crate24)
	(content-crate food crate25)
	(content-crate food crate26)
	(content-crate food crate27)
	(content-crate food crate28)
	(content-crate medicine crate29)
	(content-crate medicine crate30)
	(content-crate medicine crate31)
	(person-at person1 loc4)
	(person-at person2 loc31)
	(person-at person3 loc2)
	(person-at person4 loc25)
	(person-at person5 loc10)
	(person-at person6 loc7)
	(person-at person7 loc4)
	(person-at person8 loc12)
	(person-at person9 loc11)
	(person-at person10 loc27)
	(person-at person11 loc18)
	(person-at person12 loc9)
	(person-at person13 loc9)
	(person-at person14 loc16)
	(person-at person15 loc31)
	(person-at person16 loc4)
	(person-at person17 loc31)
	(person-at person18 loc16)
	(person-at person19 loc27)
	(person-at person20 loc29)
	(person-at person21 loc22)
	(person-at person22 loc5)
	(person-at person23 loc28)
	(person-at person24 loc13)
	(person-at person25 loc12)
	(person-at person26 loc21)
	(person-at person27 loc21)
	(person-at person28 loc21)
	(person-at person29 loc30)
	(person-at person30 loc1)
	(person-at person31 loc8)
	(person-need person2 food)
	(person-need person3 food)
	(person-need person4 food)
	(person-need person5 food)
	(person-need person6 food)
	(person-need person7 food)
	(person-need person8 medicine)
	(person-need person9 food)
	(person-need person10 food)
	(person-need person11 food)
	(person-need person12 food)
	(person-need person13 food)
	(person-need person14 food)
	(person-need person15 food)
	(person-need person16 food)
	(person-need person17 food)
	(person-need person18 food)
	(person-need person19 food)
	(person-need person20 food)
	(person-need person21 medicine)
	(person-need person22 food)
	(person-need person23 food)
	(person-need person23 medicine)
	(person-need person24 food)
	(person-need person25 food)
	(person-need person26 food)
	(person-need person27 food)
	(person-need person28 food)
	(person-need person29 food)
	(person-need person30 food)
	(person-need person31 food)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person7 food)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person21 medicine)
	(has-content-person person22 food)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person24 food)
	(has-content-person person25 food)
	(has-content-person person26 food)
	(has-content-person person27 food)
	(has-content-person person28 food)
	(has-content-person person29 food)
	(has-content-person person30 food)
	(has-content-person person31 food)
))
)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 32
2. (pick-up-crate crate29 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate29 warehouse)
   added: (has-crate-drone-arm drone1 right crate29)
   goals met: 0 of 32
3. (pick-up-crate crate1 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 0 of 32
4. (drone-move warehouse loc2 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 0 of 32
5. (drop-crate loc2 person3 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person3 food) (empty-arm drone1 left)
   goals met: 1 of 32
6. (drone-move loc2 warehouse drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 1 of 32
7. (pick-up-crate crate2 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 1 of 32
8. (drone-move warehouse loc25 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc25)
   goals met: 1 of 32
9. (drop-crate loc25 person4 crate2 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person4 food) (empty-arm drone1 left)
   goals met: 2 of 32
10. (drone-move loc25 warehouse drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 32
11. (pick-up-crate crate3 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate3 warehouse)
   added: (has-crate-drone-arm drone1 left crate3)
   goals met: 2 of 32
12. (drone-move warehouse loc10 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc10)
   goals met: 2 of 32
13. (drop-crate loc10 person5 crate3 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate3)
   added: (has-content-person person5 food) (empty-arm drone1 left)
   goals met: 3 of 32
14. (drone-move loc10 warehouse drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 32
15. (pick-up-crate crate4 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate4 warehouse)
   added: (has-crate-drone-arm drone1 left crate4)
   goals met: 3 of 32
16. (drone-move warehouse loc7 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 3 of 32
17. (drop-crate loc7 person6 crate4 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate4)
   added: (has-content-person person6 food) (empty-arm drone1 left)
   goals met: 4 of 32
18. (drone-move loc7 warehouse drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 32
19. (pick-up-crate crate5 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 warehouse)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 4 of 32
20. (drone-move warehouse loc11 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc11)
   goals met: 4 of 32
21. (drop-crate loc11 person9 crate5 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person9 food) (empty-arm drone1 left)
   goals met: 5 of 32
22. (drone-move loc11 warehouse drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 32
23. (pick-up-crate crate6 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate6 warehouse)
   added: (has-crate-drone-arm drone1 left crate6)
   goals met: 5 of 32
24. (drone-move warehouse loc18 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 5 of 32
25. (drop-crate loc18 person11 crate6 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate6)
   added: (has-content-person person11 food) (empty-arm drone1 left)
   goals met: 6 of 32
26. (drone-move loc18 warehouse drone1)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 32
27. (pick-up-crate crate7 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate7 warehouse)
   added: (has-crate-drone-arm drone1 left crate7)
   goals met: 6 of 32
28. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 6 of 32
29. (drone-move loc9 loc29 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc29)
   goals met: 6 of 32
30. (drop-crate loc29 person20 crate7 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate7)
   added: (has-content-person person20 food) (empty-arm drone1 left)
   goals met: 7 of 32
31. (drone-move loc29 warehouse drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 32
32. (pick-up-crate crate8 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 warehouse)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 7 of 32
33. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 7 of 32
34. (drone-move loc9 loc22 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc22)
   goals met: 7 of 32
35. (drop-crate loc22 person21 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate29)
   added: (has-content-person person21 medicine) (empty-arm drone1 right)
   goals met: 8 of 32
36. (drone-move loc22 warehouse drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 32
37. (pick-up-crate crate30 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate30 warehouse)
   added: (has-crate-drone-arm drone1 right crate30)
   goals met: 8 of 32
38. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 8 of 32
39. (drone-move loc9 loc5 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc5)
   goals met: 8 of 32
40. (drop-crate loc5 person22 crate8 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person22 food) (empty-arm drone1 left)
   goals met: 9 of 32
41. (drone-move loc5 warehouse drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 32
42. (pick-up-crate crate9 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate9 warehouse)
   added: (has-crate-drone-arm drone1 left crate9)
   goals met: 9 of 32
43. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 9 of 32
44. (drone-move loc9 loc13 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc13)
   goals met: 9 of 32
45. (drop-crate loc13 person24 crate9 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate9)
   added: (has-content-person person24 food) (empty-arm drone1 left)
   goals met: 10 of 32
46. (drone-move loc13 warehouse drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 32
47. (pick-up-crate crate10 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate10 warehouse)
   added: (has-crate-drone-arm drone1 left crate10)
   goals met: 10 of 32
48. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 10 of 32
49. (drone-move loc9 loc30 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc30)
   goals met: 10 of 32
50. (drop-crate loc30 person29 crate10 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate10)
   added: (has-content-person person29 food) (empty-arm drone1 left)
   goals met: 11 of 32
51. (drone-move loc30 warehouse drone1)
   deleted: (drone-at drone1 loc30)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 32
52. (pick-up-crate crate11 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate11 warehouse)
   added: (has-crate-drone-arm drone1 left crate11)
   goals met: 11 of 32
53. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 11 of 32
54. (drone-move loc9 loc1 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc1)
   goals met: 11 of 32
55. (drop-crate loc1 person30 crate11 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate11)
   added: (has-content-person person30 food) (empty-arm drone1 left)
   goals met: 12 of 32
56. (drone-move loc1 warehouse drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 32
57. (pick-up-crate crate12 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate12 warehouse)
   added: (has-crate-drone-arm drone1 left crate12)
   goals met: 12 of 32
58. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 12 of 32
59. (drone-move loc9 loc8 drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 loc8)
   goals met: 12 of 32
60. (drop-crate loc8 person31 crate12 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate12)
   added: (has-content-person person31 food) (empty-arm drone1 left)
   goals met: 13 of 32
61. (drone-move loc8 warehouse drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 32
62. (pick-up-crate crate13 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate13 warehouse)
   added: (has-crate-drone-arm drone1 left crate13)
   goals met: 13 of 32
63. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 13 of 32
64. (drop-crate loc9 person12 crate13 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate13)
   added: (has-content-person person12 food) (empty-arm drone1 left)
   goals met: 14 of 32
65. (drone-move loc9 warehouse drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 32
66. (pick-up-crate crate14 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate14 warehouse)
   added: (has-crate-drone-arm drone1 left crate14)
   goals met: 14 of 32
67. (drone-move warehouse loc9 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 14 of 32
68. (drop-crate loc9 person13 crate14 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate14)
   added: (has-content-person person13 food) (empty-arm drone1 left)
   goals met: 15 of 32
69. (drone-move loc9 warehouse drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 32
70. (pick-up-crate crate15 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate15 warehouse)
   added: (has-crate-drone-arm drone1 left crate15)
   goals met: 15 of 32
71. (drone-move warehouse loc4 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 15 of 32
72. (drop-crate loc4 person7 crate15 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate15)
   added: (has-content-person person7 food) (empty-arm drone1 left)
   goals met: 16 of 32
73. (drone-move loc4 warehouse drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 32
74. (pick-up-crate crate16 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate16 warehouse)
   added: (has-crate-drone-arm drone1 left crate16)
   goals met: 16 of 32
75. (drone-move warehouse loc4 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 16 of 32
76. (drop-crate loc4 person16 crate16 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate16)
   added: (has-content-person person16 food) (empty-arm drone1 left)
   goals met: 17 of 32
77. (drone-move loc4 warehouse drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 32
78. (pick-up-crate crate17 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate17 warehouse)
   added: (has-crate-drone-arm drone1 left crate17)
   goals met: 17 of 32
79. (drone-move warehouse loc31 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc31)
   goals met: 17 of 32
80. (drop-crate loc31 person2 crate17 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate17)
   added: (has-content-person person2 food) (empty-arm drone1 left)
   goals met: 18 of 32
81. (drone-move loc31 warehouse drone1)
   deleted: (drone-at drone1 loc31)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 32
82. (pick-up-crate crate18 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate18 warehouse)
   added: (has-crate-drone-arm drone1 left crate18)
   goals met: 18 of 32
83. (drone-move warehouse loc31 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc31)
   goals met: 18 of 32
84. (drop-crate loc31 person15 crate18 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate18)
   added: (has-content-person person15 food) (empty-arm drone1 left)
   goals met: 19 of 32
85. (drone-move loc31 warehouse drone1)
   deleted: (drone-at drone1 loc31)
   added: (drone-at drone1 warehouse)
   goals met: 19 of 32
86. (pick-up-crate crate19 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate19 warehouse)
   added: (has-crate-drone-arm drone1 left crate19)
   goals met: 19 of 32
87. (drone-move warehouse loc31 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc31)
   goals met: 19 of 32
88. (drop-crate loc31 person17 crate19 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate19)
   added: (has-content-person person17 food) (empty-arm drone1 left)
   goals met: 20 of 32
89. (drone-move loc31 warehouse drone1)
   deleted: (drone-at drone1 loc31)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 32
90. (pick-up-crate crate20 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate20 warehouse)
   added: (has-crate-drone-arm drone1 left crate20)
   goals met: 20 of 32
91. (drone-move warehouse loc16 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc16)
   goals met: 20 of 32
92. (drop-crate loc16 person14 crate20 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate20)
   added: (has-content-person person14 food) (empty-arm drone1 left)
   goals met: 21 of 32
93. (drone-move loc16 warehouse drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 warehouse)
   goals met: 21 of 32
94. (pick-up-crate crate21 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate21 warehouse)
   added: (has-crate-drone-arm drone1 left crate21)
   goals met: 21 of 32
95. (drone-move warehouse loc16 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc16)
   goals met: 21 of 32
96. (drop-crate loc16 person18 crate21 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate21)
   added: (has-content-person person18 food) (empty-arm drone1 left)
   goals met: 22 of 32
97. (drone-move loc16 warehouse drone1)
   deleted: (drone-at drone1 loc16)
   added: (drone-at drone1 warehouse)
   goals met: 22 of 32
98. (pick-up-crate crate22 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate22 warehouse)
   added: (has-crate-drone-arm drone1 left crate22)
   goals met: 22 of 32
99. (drone-move warehouse loc27 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 22 of 32
100. (drop-crate loc27 person10 crate22 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate22)
   added: (has-content-person person10 food) (empty-arm drone1 left)
   goals met: 23 of 32
101. (drone-move loc27 warehouse drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 23 of 32
102. (pick-up-crate crate23 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate23 warehouse)
   added: (has-crate-drone-arm drone1 left crate23)
   goals met: 23 of 32
103. (drone-move warehouse loc27 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 23 of 32
104. (drop-crate loc27 person19 crate23 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate23)
   added: (has-content-person person19 food) (empty-arm drone1 left)
   goals met: 24 of 32
105. (drone-move loc27 warehouse drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 24 of 32
106. (pick-up-crate crate24 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate24 warehouse)
   added: (has-crate-drone-arm drone1 left crate24)
   goals met: 24 of 32
107. (drone-move warehouse loc28 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc28)
   goals met: 24 of 32
108. (drop-crate loc28 person23 crate24 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate24)
   added: (has-content-person person23 food) (empty-arm drone1 left)
   goals met: 25 of 32
109. (drone-move loc28 warehouse drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 warehouse)
   goals met: 25 of 32
110. (pick-up-crate crate25 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate25 warehouse)
   added: (has-crate-drone-arm drone1 left crate25)
   goals met: 25 of 32
111. (drone-move warehouse loc28 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc28)
   goals met: 25 of 32
112. (drop-crate loc28 person23 crate30 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate30)
   added: (has-content-person person23 medicine) (empty-arm drone1 right)
   goals met: 26 of 32
113. (drone-move loc28 warehouse drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 warehouse)
   goals met: 26 of 32
114. (pick-up-crate crate31 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate31 warehouse)
   added: (has-crate-drone-arm drone1 right crate31)
   goals met: 26 of 32
115. (drone-move warehouse loc12 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 26 of 32
116. (drop-crate loc12 person8 crate31 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate31)
   added: (has-content-person person8 medicine) (empty-arm drone1 right)
   goals met: 27 of 32
117. (drop-crate loc12 person25 crate25 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate25)
   added: (has-content-person person25 food) (empty-arm drone1 left)
   goals met: 28 of 32
118. (drone-move loc12 warehouse drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 warehouse)
   goals met: 28 of 32
119. (pick-up-crate crate26 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate26 warehouse)
   added: (has-crate-drone-arm drone1 right crate26)
   goals met: 28 of 32
120. (drone-move warehouse loc21 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc21)
   goals met: 28 of 32
121. (drop-crate loc21 person26 crate26 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate26)
   added: (has-content-person person26 food) (empty-arm drone1 right)
   goals met: 29 of 32
122. (drone-move loc21 warehouse drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 warehouse)
   goals met: 29 of 32
123. (pick-up-crate crate27 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate27 warehouse)
   added: (has-crate-drone-arm drone1 right crate27)
   goals met: 29 of 32
124. (drone-move warehouse loc21 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc21)
   goals met: 29 of 32
125. (drop-crate loc21 person27 crate27 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate27)
   added: (has-content-person person27 food) (empty-arm drone1 right)
   goals met: 30 of 32
126. (drone-move loc21 warehouse drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 warehouse)
   goals met: 30 of 32
127. (pick-up-crate crate28 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate28 warehouse)
   added: (has-crate-drone-arm drone1 right crate28)
   goals met: 30 of 32
128. (drone-move warehouse loc21 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc21)
   goals met: 30 of 32
129. (drop-crate loc21 person28 crate28 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate28)
   added: (has-content-person person28 food) (empty-arm drone1 right)
   goals met: 31 of 32
130. (drone-move loc21 depot drone1)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 depot)
   goals met: 32 of 32
